h2zero/n-able-Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC. All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2021 Ryan Powell. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA

menu.chip=Chip
menu.role=NimBLE Role
menu.cppDbgLvl=NimBLE debug log level
menu.lfclk=Low Frequency Clock
menu.bootloader=Bootloader type


# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52832

Generic_nRF52832.upload.tool=openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.jlink_device=nRF52832_xxAA
Generic_nRF52832.upload.maximum_size=507904
Generic_nRF52832.upload.maximum_data_size=65536

Generic_nRF52832.bootloader.tool=openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=64000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld
Generic_nRF52832.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52832.menu.role.all=All
Generic_nRF52832.menu.role.all.build.nimble_flags=
Generic_nRF52832.menu.role.periph=Peripheral
Generic_nRF52832.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52832.menu.role.adv=Advertiser
Generic_nRF52832.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52832.menu.role.scan=Scanner
Generic_nRF52832.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52832.menu.role.central=Client
Generic_nRF52832.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52832.menu.cppDbgLvl.none=None
Generic_nRF52832.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52832.menu.cppDbgLvl.error=Error
Generic_nRF52832.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52832.menu.cppDbgLvl.warn=Warn
Generic_nRF52832.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52832.menu.cppDbgLvl.info=Info
Generic_nRF52832.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52832.menu.cppDbgLvl.debug=Debug
Generic_nRF52832.menu.cppDbgLvl.debug.build.cpp_debug=4

Generic_nRF52832.menu.bootloader.none=No bootloader
Generic_nRF52832.menu.bootloader.none.bootloader.flags=
Generic_nRF52832.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

Generic_nRF52832.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
Generic_nRF52832.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
Generic_nRF52832.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_ble.upload.maximum_size=303104
Generic_nRF52832.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
Generic_nRF52832.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
Generic_nRF52832.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
Generic_nRF52832.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

Generic_nRF52832.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
Generic_nRF52832.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
Generic_nRF52832.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
Generic_nRF52832.menu.bootloader.adafruit_serial.upload.maximum_size=454656
Generic_nRF52832.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
Generic_nRF52832.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
Generic_nRF52832.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
Generic_nRF52832.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


nRF52DK.name=Nordic nRF52832DK (PCA10040)

nRF52DK.vid.0=0x1366
nRF52DK.pid.0=0x1015

nRF52DK.upload.tool=jlink
nRF52DK.upload.protocol=jlink
nRF52DK.upload.target=nrf52
nRF52DK.upload.jlink_device=nRF52832_xxAA
nRF52DK.upload.maximum_size=507904
nRF52DK.upload.maximum_data_size=65536
nRF52DK.upload.setup_command=transport select swd;

nRF52DK.bootloader.tool=openocd

nRF52DK.build.mcu=cortex-m4
nRF52DK.build.f_cpu=64000000
nRF52DK.build.board=NRF52_DK
nRF52DK.build.core=nRF5
nRF52DK.build.variant=nRF52832_DK
nRF52DK.build.variant_system_lib=
nRF52DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52DK.build.ldscript=nrf52_xxaa.ld
nRF52DK.build.lfclk_flags=-DUSE_LFXO
nRF52DK.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52DK.menu.role.all=All
nRF52DK.menu.role.all.build.nimble_flags=
nRF52DK.menu.role.periph=Peripheral
nRF52DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52DK.menu.role.adv=Advertiser
nRF52DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52DK.menu.role.scan=Scanner
nRF52DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52DK.menu.role.central=Client
nRF52DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52DK.menu.cppDbgLvl.none=None
nRF52DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52DK.menu.cppDbgLvl.error=Error
nRF52DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52DK.menu.cppDbgLvl.warn=Warn
nRF52DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52DK.menu.cppDbgLvl.info=Info
nRF52DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52DK.menu.cppDbgLvl.debug=Debug
nRF52DK.menu.cppDbgLvl.debug.build.cpp_debug=4

nRF52DK.menu.bootloader.none=No bootloader
nRF52DK.menu.bootloader.none.bootloader.flags=
nRF52DK.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

nRF52DK.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
nRF52DK.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
nRF52DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_ble.upload.maximum_size=303104
nRF52DK.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
nRF52DK.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52DK.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
nRF52DK.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

nRF52DK.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
nRF52DK.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
nRF52DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52DK.menu.bootloader.adafruit_serial.upload.maximum_size=454656
nRF52DK.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
nRF52DK.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52DK.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
nRF52DK.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld

