h2zero/n-able-Arduino/boards.txt
feather52832.name=Adafruit Feather nRF52832

feather52832.upload.tool=openocd
feather52832.upload.target=nrf52
feather52832.upload.jlink_device=nRF52832_xxAA
feather52832.upload.maximum_size=303104
feather52832.upload.maximum_data_size=51712

feather52832.bootloader.tool=openocd

feather52832.build.mcu=cortex-m4
feather52832.build.f_cpu=64000000
feather52832.build.board=NRF52832_FEATHER
feather52832.build.core=nRF5
feather52832.build.variant=feather_nrf52832
feather52832.build.variant_system_lib=
feather52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52832.build.ldscript=nrf52_xxaa.ld
feather52832.build.lfclk_flags=-DUSE_LFXO
feather52832.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
feather52832.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

feather52832.menu.role.all=All
feather52832.menu.role.all.build.nimble_flags=
feather52832.menu.role.periph=Peripheral
feather52832.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52832.menu.role.adv=Advertiser
feather52832.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52832.menu.role.scan=Scanner
feather52832.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52832.menu.role.central=Client
feather52832.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52832.menu.cppDbgLvl.none=None
feather52832.menu.cppDbgLvl.none.build.cpp_debug=0
feather52832.menu.cppDbgLvl.error=Error
feather52832.menu.cppDbgLvl.error.build.cpp_debug=1
feather52832.menu.cppDbgLvl.warn=Warn
feather52832.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52832.menu.cppDbgLvl.info=Info
feather52832.menu.cppDbgLvl.info.build.cpp_debug=3
feather52832.menu.cppDbgLvl.debug=Debug
feather52832.menu.cppDbgLvl.debug.build.cpp_debug=4

feather52832.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
feather52832.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
feather52832.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52832.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
feather52832.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52832.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
feather52832.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

feather52832.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
feather52832.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
feather52832.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
feather52832.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
feather52832.menu.bootloader.adafruit_serial.upload.maximum_size=454656
feather52832.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
feather52832.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52832.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
feather52832.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld

feather52832.menu.bootloader.none=No bootloader
feather52832.menu.bootloader.none.bootloader.flags=
feather52832.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex
feather52832.menu.bootloader.none.upload.maximum_size=507904
feather52832.menu.bootloader.none.upload.maximum_data_size=65536

BT5032A-TB.name=Ebyte BT5032A-TB

BT5032A-TB.upload.tool=openocd
BT5032A-TB.upload.target=nrf52
BT5032A-TB.upload.jlink_device=nRF52832_xxAA
BT5032A-TB.upload.maximum_size=507904
BT5032A-TB.upload.maximum_data_size=65536

BT5032A-TB.bootloader.tool=openocd

BT5032A-TB.build.mcu=cortex-m4
BT5032A-TB.build.f_cpu=64000000
BT5032A-TB.build.board=BT5032A_TB
BT5032A-TB.build.core=nRF5
BT5032A-TB.build.variant=BT5032A_TB
BT5032A-TB.build.variant_system_lib=
BT5032A-TB.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5032A-TB.build.ldscript=nrf52832_xxaa.ld
BT5032A-TB.build.lfclk_flags=-DUSE_LFXO
BT5032A-TB.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BT5032A-TB.menu.role.all=All
BT5032A-TB.menu.role.all.build.nimble_flags=
BT5032A-TB.menu.role.periph=Peripheral
BT5032A-TB.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5032A-TB.menu.role.adv=Advertiser
BT5032A-TB.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5032A-TB.menu.role.scan=Scanner
BT5032A-TB.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5032A-TB.menu.role.central=Client
BT5032A-TB.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5032A-TB.menu.cppDbgLvl.none=None
BT5032A-TB.menu.cppDbgLvl.none.build.cpp_debug=0
BT5032A-TB.menu.cppDbgLvl.error=Error
BT5032A-TB.menu.cppDbgLvl.error.build.cpp_debug=1
BT5032A-TB.menu.cppDbgLvl.warn=Warn
BT5032A-TB.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5032A-TB.menu.cppDbgLvl.info=Info
BT5032A-TB.menu.cppDbgLvl.info.build.cpp_debug=3
BT5032A-TB.menu.cppDbgLvl.debug=Debug
BT5032A-TB.menu.cppDbgLvl.debug.build.cpp_debug=4

BT5032A-TB.menu.bootloader.none=No bootloader
BT5032A-TB.menu.bootloader.none.bootloader.flags=
BT5032A-TB.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

BT5032A-TB.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
BT5032A-TB.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
BT5032A-TB.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_ble.upload.maximum_size=303104
BT5032A-TB.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
BT5032A-TB.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
BT5032A-TB.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
BT5032A-TB.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

