h2zero/n-able-Arduino/boards.txt
BT5032A-TB.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
BT5032A-TB.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
BT5032A-TB.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
BT5032A-TB.menu.bootloader.adafruit_serial.upload.maximum_size=454656
BT5032A-TB.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
BT5032A-TB.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
BT5032A-TB.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
BT5032A-TB.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


bluey.name=Electronut labs bluey

bluey.upload.tool=openocd
bluey.upload.target=nrf52
bluey.upload.jlink_device=nRF52832_xxAA
bluey.upload.maximum_size=507904
bluey.upload.maximum_data_size=65536

bluey.bootloader.tool=openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=64000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld
bluey.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

bluey.menu.lfclk.lfxo=Crystal Oscillator
bluey.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
bluey.menu.lfclk.lfrc=RC Oscillator
bluey.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
bluey.menu.lfclk.lfsynt=Synthesized
bluey.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

bluey.menu.role.all=All
bluey.menu.role.all.build.nimble_flags=
bluey.menu.role.periph=Peripheral
bluey.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
bluey.menu.role.adv=Advertiser
bluey.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
bluey.menu.role.scan=Scanner
bluey.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
bluey.menu.role.central=Client
bluey.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

bluey.menu.cppDbgLvl.none=None
bluey.menu.cppDbgLvl.none.build.cpp_debug=0
bluey.menu.cppDbgLvl.error=Error
bluey.menu.cppDbgLvl.error.build.cpp_debug=1
bluey.menu.cppDbgLvl.warn=Warn
bluey.menu.cppDbgLvl.warn.build.cpp_debug=2
bluey.menu.cppDbgLvl.info=Info
bluey.menu.cppDbgLvl.info.build.cpp_debug=3
bluey.menu.cppDbgLvl.debug=Debug
bluey.menu.cppDbgLvl.debug.build.cpp_debug=4

bluey.menu.bootloader.none=No bootloader
bluey.menu.bootloader.none.bootloader.flags=
bluey.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

bluey.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
bluey.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
bluey.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
bluey.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
bluey.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
bluey.menu.bootloader.adafruit_ble.upload.maximum_size=303104
bluey.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
bluey.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
bluey.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
bluey.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

bluey.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
bluey.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
bluey.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
bluey.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
bluey.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
bluey.menu.bootloader.adafruit_serial.upload.maximum_size=454656
bluey.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
bluey.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
bluey.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
bluey.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


hackaBLE.name=Electronut labs hackaBLE

hackaBLE.upload.tool=openocd
hackaBLE.upload.target=nrf52
hackaBLE.upload.jlink_device=nRF52832_xxAA
hackaBLE.upload.maximum_size=507904
hackaBLE.upload.maximum_data_size=65536

hackaBLE.bootloader.tool=openocd

hackaBLE.build.mcu=cortex-m4
hackaBLE.build.f_cpu=64000000
hackaBLE.build.board=ELECTRONUT_HACKABLE
hackaBLE.build.core=nRF5
hackaBLE.build.variant=hackaBLE
hackaBLE.build.variant_system_lib=
hackaBLE.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE.build.ldscript=nrf52_xxaa.ld
hackaBLE.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

hackaBLE.menu.lfclk.lfxo=Crystal Oscillator
hackaBLE.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
hackaBLE.menu.lfclk.lfrc=RC Oscillator
hackaBLE.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
hackaBLE.menu.lfclk.lfsynt=Synthesized
hackaBLE.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

hackaBLE.menu.role.all=All
hackaBLE.menu.role.all.build.nimble_flags=
hackaBLE.menu.role.periph=Peripheral
hackaBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE.menu.role.adv=Advertiser
hackaBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE.menu.role.scan=Scanner
hackaBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE.menu.role.central=Client
hackaBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

