h2zero/n-able-Arduino/boards.txt
hackaBLE.menu.cppDbgLvl.none=None
hackaBLE.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE.menu.cppDbgLvl.error=Error
hackaBLE.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE.menu.cppDbgLvl.warn=Warn
hackaBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE.menu.cppDbgLvl.info=Info
hackaBLE.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE.menu.cppDbgLvl.debug=Debug
hackaBLE.menu.cppDbgLvl.debug.build.cpp_debug=4

hackaBLE.menu.bootloader.none=No bootloader
hackaBLE.menu.bootloader.none.bootloader.flags=
hackaBLE.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

hackaBLE.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
hackaBLE.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
hackaBLE.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_ble.upload.maximum_size=303104
hackaBLE.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
hackaBLE.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
hackaBLE.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
hackaBLE.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

hackaBLE.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
hackaBLE.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
hackaBLE.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
hackaBLE.menu.bootloader.adafruit_serial.upload.maximum_size=454656
hackaBLE.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
hackaBLE.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
hackaBLE.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
hackaBLE.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


hackaBLE_v2.name=Electronut labs hackaBLE_v2

hackaBLE_v2.upload.tool=openocd
hackaBLE_v2.upload.target=nrf52
hackaBLE_v2.upload.jlink_device=nRF52832_xxAA
hackaBLE_v2.upload.maximum_size=507904
hackaBLE_v2.upload.maximum_data_size=65536

hackaBLE_v2.bootloader.tool=openocd

hackaBLE_v2.build.mcu=cortex-m4
hackaBLE_v2.build.f_cpu=64000000
hackaBLE_v2.build.board=ELECTRONUT_HACKABLE_V2
hackaBLE_v2.build.core=nRF5
hackaBLE_v2.build.variant=hackaBLE_v2
hackaBLE_v2.build.variant_system_lib=
hackaBLE_v2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE_v2.build.ldscript=nrf52_xxaa.ld
hackaBLE_v2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

hackaBLE_v2.menu.lfclk.lfxo=Crystal Oscillator
hackaBLE_v2.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
hackaBLE_v2.menu.lfclk.lfrc=RC Oscillator
hackaBLE_v2.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
hackaBLE_v2.menu.lfclk.lfsynt=Synthesized
hackaBLE_v2.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

hackaBLE_v2.menu.role.all=All
hackaBLE_v2.menu.role.all.build.nimble_flags=
hackaBLE_v2.menu.role.periph=Peripheral
hackaBLE_v2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE_v2.menu.role.adv=Advertiser
hackaBLE_v2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE_v2.menu.role.scan=Scanner
hackaBLE_v2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE_v2.menu.role.central=Client
hackaBLE_v2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

hackaBLE_v2.menu.cppDbgLvl.none=None
hackaBLE_v2.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE_v2.menu.cppDbgLvl.error=Error
hackaBLE_v2.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE_v2.menu.cppDbgLvl.warn=Warn
hackaBLE_v2.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE_v2.menu.cppDbgLvl.info=Info
hackaBLE_v2.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE_v2.menu.cppDbgLvl.debug=Debug
hackaBLE_v2.menu.cppDbgLvl.debug.build.cpp_debug=4

hackaBLE_v2.menu.bootloader.none=No bootloader
hackaBLE_v2.menu.bootloader.none.bootloader.flags=
hackaBLE_v2.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

hackaBLE_v2.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
hackaBLE_v2.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
hackaBLE_v2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_ble.upload.maximum_size=303104
hackaBLE_v2.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
hackaBLE_v2.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
hackaBLE_v2.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
hackaBLE_v2.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

hackaBLE_v2.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
hackaBLE_v2.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
hackaBLE_v2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
hackaBLE_v2.menu.bootloader.adafruit_serial.upload.maximum_size=454656
hackaBLE_v2.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
hackaBLE_v2.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
hackaBLE_v2.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
hackaBLE_v2.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


Blend2.name=RedBear BLE Nano 2

Blend2.vid.0=0x0204
Blend2.pid.0=0x0d28

Blend2.upload.tool=openocd
Blend2.upload.target=nrf52
Blend2.upload.jlink_device=nRF52832_xxAA
Blend2.upload.maximum_size=507904
Blend2.upload.maximum_data_size=65536
Blend2.upload.protocol=cmsis-dap
Blend2.upload.setup_command=transport select swd;

Blend2.bootloader.tool=openocd

Blend2.build.mcu=cortex-m4
Blend2.build.f_cpu=64000000
Blend2.build.board=RB_BLEND_2
Blend2.build.core=nRF5
Blend2.build.variant=RedBear_Blend2
Blend2.build.variant_system_lib=
Blend2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Blend2.build.ldscript=nrf52_xxaa.ld
Blend2.build.lfclk_flags=-DUSE_LFXO
Blend2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Blend2.menu.role.all=All
Blend2.menu.role.all.build.nimble_flags=
Blend2.menu.role.periph=Peripheral
Blend2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Blend2.menu.role.adv=Advertiser
Blend2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Blend2.menu.role.scan=Scanner
Blend2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Blend2.menu.role.central=Client
Blend2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Blend2.menu.cppDbgLvl.none=None
Blend2.menu.cppDbgLvl.none.build.cpp_debug=0
Blend2.menu.cppDbgLvl.error=Error
Blend2.menu.cppDbgLvl.error.build.cpp_debug=1
Blend2.menu.cppDbgLvl.warn=Warn
Blend2.menu.cppDbgLvl.warn.build.cpp_debug=2
Blend2.menu.cppDbgLvl.info=Info
Blend2.menu.cppDbgLvl.info.build.cpp_debug=3
Blend2.menu.cppDbgLvl.debug=Debug
Blend2.menu.cppDbgLvl.debug.build.cpp_debug=4

Blend2.menu.bootloader.none=No bootloader
Blend2.menu.bootloader.none.bootloader.flags=
Blend2.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

Blend2.menu.bootloader.adafruit_ble=Adafruit BLE (s132 softdevice)
Blend2.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
Blend2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_ble.upload.maximum_size=303104
Blend2.menu.bootloader.adafruit_ble.upload.maximum_data_size=51712
Blend2.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
Blend2.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52832_s132_v6_adabl.hex
Blend2.menu.bootloader.adafruit_ble.build.ldscript=nrf52832_s132_v6_adabl.ld

Blend2.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
Blend2.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
Blend2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
Blend2.menu.bootloader.adafruit_serial.upload.maximum_size=454656
Blend2.menu.bootloader.adafruit_serial.upload.maximum_data_size=65528
Blend2.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
Blend2.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52832_serial_adabl.hex
Blend2.menu.bootloader.adafruit_serial.build.ldscript=nrf52832_serial_adabl.ld


BLENano2.name=RedBear BLE Nano 2

BLENano2.vid.0=0x0204
BLENano2.pid.0=0x0d28

