h2zero/n-able-Arduino/boards.txt
nRF52840_DK.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
nRF52840_DK.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
nRF52840_DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.maximum_size=823296
nRF52840_DK.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
nRF52840_DK.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52840_DK.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
nRF52840_DK.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

nRF52840_DK.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
nRF52840_DK.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
nRF52840_DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_ble.upload.maximum_size=827392
nRF52840_DK.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
nRF52840_DK.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52840_DK.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
nRF52840_DK.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

nRF52840_DK.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
nRF52840_DK.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
nRF52840_DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52840_DK.menu.bootloader.adafruit_serial.upload.maximum_size=978944
nRF52840_DK.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
nRF52840_DK.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52840_DK.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
nRF52840_DK.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld


nRF52840_dongle.name=nRF52840 Dongle

nRF52840_dongle.vid.0=0x1915
nRF52840_dongle.pid.0=0x521B
nRF52840_dongle.vid.1=0x1915
nRF52840_dongle.pid.1=0x521F

nRF52840_dongle.upload.tool=nrfutil
nRF52840_dongle.upload.target=nrf52
nRF52840_dongle.upload.jlink_device=nRF52840_xxAA
nRF52840_dongle.upload.protocol=nrfutil
nRF52840_dongle.upload.maximum_size=897024
nRF52840_dongle.upload.maximum_data_size=262136

nRF52840_dongle.bootloader.tool=nrfutil

nRF52840_dongle.build.mcu=cortex-m4
nRF52840_dongle.build.f_cpu=64000000
nRF52840_dongle.build.board=NRF52840_DONGLE
nRF52840_dongle.build.core=nRF5
nRF52840_dongle.build.variant=nRF52840_Dongle
nRF52840_dongle.build.variant_system_lib=
nRF52840_dongle.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_dongle.build.ldscript=nrf52840_dongle.ld
nRF52840_dongle.build.vid=0x1915
nRF52840_dongle.build.pid=0x521B
nRF52840_dongle.build.usb_manufacturer="Nordic Semiconductor"
nRF52840_dongle.build.usb_product="nRF52840 Dongle"
nRF52840_dongle.build.lfclk_flags=-DUSE_LFXO
nRF52840_dongle.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
nRF52840_dongle.build.dfu_pattern={nrfutil.dfu_pattern}

nRF52840_dongle.menu.role.all=All
nRF52840_dongle.menu.role.all.build.nimble_flags=
nRF52840_dongle.menu.role.periph=Peripheral
nRF52840_dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_dongle.menu.role.adv=Advertiser
nRF52840_dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_dongle.menu.role.scan=Scanner
nRF52840_dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_dongle.menu.role.central=Client
nRF52840_dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_dongle.menu.cppDbgLvl.none=None
nRF52840_dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_dongle.menu.cppDbgLvl.error=Error
nRF52840_dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_dongle.menu.cppDbgLvl.warn=Warn
nRF52840_dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_dongle.menu.cppDbgLvl.info=Info
nRF52840_dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_dongle.menu.cppDbgLvl.debug=Debug
nRF52840_dongle.menu.cppDbgLvl.debug.build.cpp_debug=4

nRF52840_dongle.menu.bootloader.none=Nordic bootloader
nRF52840_dongle.menu.bootloader.none.bootloader.flags=-DUSE_NORDIC_BL
nRF52840_dongle.menu.bootloader.none.build.bootloader.file=


BT5040.name=E104-BT5040

BT5040.vid.0=0x1915
BT5040.pid.0=0x521B
BT5040.vid.1=0x1915
BT5040.pid.1=0x521F

BT5040.upload.tool=nrfutil
BT5040.upload.target=nrf52
BT5040.upload.jlink_device=nRF52840_xxAA
BT5040.upload.protocol=nrfutil
BT5040.upload.maximum_size=897024
BT5040.upload.maximum_data_size=262136

BT5040.bootloader.tool=nrfutil

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=nRF52840_Dongle
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x1915
BT5040.build.pid=0x521B
BT5040.build.usb_manufacturer="Ebyte"
BT5040.build.usb_product="E104-BT5040UA"
BT5040.build.lfclk_flags=-DUSE_LFXO
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
BT5040.build.dfu_pattern={nrfutil.dfu_pattern}

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4

BT5040.menu.bootloader.none=Nordic bootloader
BT5040.menu.bootloader.none.bootloader.flags=-DUSE_NORDIC_BL
BT5040.menu.bootloader.none.build.bootloader.file=


# Seeedstudio

seeed52840sense.name=Seeed XIAO nRF52840 Sense

seeed52840sense.vid.0=0x2886
seeed52840sense.pid.0=0x8045
seeed52840sense.vid.1=0x2886
seeed52840sense.pid.1=0x0045
seeed52840sense.vid.2=0x2886
seeed52840sense.pid.2=0x0045
seeed52840sense.vid.3=0x2886
seeed52840sense.pid.3=0x8045

