h2zero/n-able-Arduino/boards.txt
seeed52840sense.upload.tool=openocd
seeed52840sense.upload.target=nrf52
seeed52840sense.upload.jlink_device=nRF52840_xxAA
seeed52840sense.upload.use_1200bps_touch=true
seeed52840sense.upload.wait_for_upload_port=true
seeed52840sense.upload.maximum_size=1032192
seeed52840sense.upload.maximum_data_size=262144
seeed52840sense.bootloader.tool=openocd

seeed52840sense.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
seeed52840sense.build.mcu=cortex-m4
seeed52840sense.build.f_cpu=64000000
seeed52840sense.build.board=Seeed_XIAO_nRF52840_Sense
seeed52840sense.build.core=nRF5
seeed52840sense.build.variant=Seeed_XIAO_nRF52840_Sense
seeed52840sense.build.usb_manufacturer="Seeed"
seeed52840sense.build.usb_product="XIAO nRF52840 Sense"
seeed52840sense.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
seeed52840sense.build.ldscript=nrf52840_xxaa.ld
seeed52840sense.build.vid=0x2886
seeed52840sense.build.pid=0x8045
seeed52840sense.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16

seeed52840sense.menu.role.all=All
seeed52840sense.menu.role.all.build.nimble_flags=
seeed52840sense.menu.role.periph=Peripheral
seeed52840sense.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
seeed52840sense.menu.role.adv=Advertiser
seeed52840sense.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
seeed52840sense.menu.role.scan=Scanner
seeed52840sense.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
seeed52840sense.menu.role.central=Client
seeed52840sense.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

seeed52840sense.menu.cppDbgLvl.none=None
seeed52840sense.menu.cppDbgLvl.none.build.cpp_debug=0
seeed52840sense.menu.cppDbgLvl.error=Error
seeed52840sense.menu.cppDbgLvl.error.build.cpp_debug=1
seeed52840sense.menu.cppDbgLvl.warn=Warn
seeed52840sense.menu.cppDbgLvl.warn.build.cpp_debug=2
seeed52840sense.menu.cppDbgLvl.info=Info
seeed52840sense.menu.cppDbgLvl.info.build.cpp_debug=3
seeed52840sense.menu.cppDbgLvl.debug=Debug
seeed52840sense.menu.cppDbgLvl.debug.build.cpp_debug=4

seeed52840sense.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
seeed52840sense.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
seeed52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_ble.upload.maximum_size=823296
seeed52840sense.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
seeed52840sense.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
seeed52840sense.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
seeed52840sense.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

seeed52840sense.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
seeed52840sense.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
seeed52840sense.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
seeed52840sense.menu.bootloader.adafruit_serial.upload.maximum_size=978944
seeed52840sense.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
seeed52840sense.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
seeed52840sense.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
seeed52840sense.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

seeed52840sense.menu.bootloader.none=No bootloader
seeed52840sense.menu.bootloader.none.bootloader.flags=
seeed52840sense.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


# Adafruit

feather52840.name=Adafruit Feather nRF52840 Express

feather52840.vid.0=0x239A
feather52840.pid.0=0x8029
feather52840.vid.1=0x239A
feather52840.pid.1=0x0029
feather52840.vid.2=0x239A
feather52840.pid.2=0x002A
feather52840.vid.3=0x239A
feather52840.pid.3=0x802A

feather52840.upload.tool=openocd
feather52840.upload.target=nrf52
feather52840.upload.jlink_device=nRF52840_xxAA
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=1032192
feather52840.upload.maximum_data_size=262144

feather52840.bootloader.tool=openocd

feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.variant_system_lib=
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029
feather52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52840.build.ldscript=nrf52840_xxaa.ld
feather52840.build.lfclk_flags=-DUSE_LFXO
feather52840.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
feather52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

feather52840.menu.role.all=All
feather52840.menu.role.all.build.nimble_flags=
feather52840.menu.role.periph=Peripheral
feather52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52840.menu.role.adv=Advertiser
feather52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52840.menu.role.scan=Scanner
feather52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52840.menu.role.central=Client
feather52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52840.menu.cppDbgLvl.none=None
feather52840.menu.cppDbgLvl.none.build.cpp_debug=0
feather52840.menu.cppDbgLvl.error=Error
feather52840.menu.cppDbgLvl.error.build.cpp_debug=1
feather52840.menu.cppDbgLvl.warn=Warn
feather52840.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52840.menu.cppDbgLvl.info=Info
feather52840.menu.cppDbgLvl.info.build.cpp_debug=3
feather52840.menu.cppDbgLvl.debug=Debug
feather52840.menu.cppDbgLvl.debug.build.cpp_debug=4

feather52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
feather52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
feather52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.maximum_size=827392
feather52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
feather52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
feather52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

feather52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
feather52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
feather52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_ble.upload.maximum_size=823296
feather52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
feather52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
feather52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

feather52840.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
feather52840.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
feather52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit_serial.upload.maximum_size=978944
feather52840.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
feather52840.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
feather52840.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

feather52840.menu.bootloader.none=No bootloader
feather52840.menu.bootloader.none.bootloader.flags=
feather52840.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


feather52840sense.name=Adafruit Feather nRF52840 Sense

feather52840sense.vid.0=0x239A
feather52840sense.pid.0=0x8087
feather52840sense.vid.1=0x239A
feather52840sense.pid.1=0x0087
feather52840sense.vid.2=0x239A
feather52840sense.pid.2=0x0088
feather52840sense.vid.3=0x239A
feather52840sense.pid.3=0x8088

feather52840sense.upload.tool=openocd
feather52840sense.upload.target=nrf52
feather52840sense.upload.jlink_device=nRF52840_xxAA
feather52840sense.upload.use_1200bps_touch=true
feather52840sense.upload.wait_for_upload_port=true
feather52840sense.upload.maximum_size=1032192
feather52840sense.upload.maximum_data_size=262144

feather52840sense.bootloader.tool=openocd

feather52840sense.build.mcu=cortex-m4
feather52840sense.build.f_cpu=64000000
feather52840sense.build.board=NRF52840_FEATHER_SENSE
feather52840sense.build.core=nRF5
feather52840sense.build.variant=feather_nrf52840_sense
feather52840sense.build.variant_system_lib=
feather52840sense.build.usb_manufacturer="Adafruit"
feather52840sense.build.usb_product="Feather nRF52840 Sense"
feather52840sense.build.vid=0x239A
feather52840sense.build.pid=0x8087
feather52840sense.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52840sense.build.ldscript=nrf52840_xxaa.ld
feather52840sense.build.lfclk_flags=-DUSE_LFRC
feather52840sense.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
feather52840sense.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

feather52840sense.menu.role.all=All
feather52840sense.menu.role.all.build.nimble_flags=
feather52840sense.menu.role.periph=Peripheral
feather52840sense.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52840sense.menu.role.adv=Advertiser
feather52840sense.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52840sense.menu.role.scan=Scanner
feather52840sense.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52840sense.menu.role.central=Client
feather52840sense.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52840sense.menu.cppDbgLvl.none=None
feather52840sense.menu.cppDbgLvl.none.build.cpp_debug=0
feather52840sense.menu.cppDbgLvl.error=Error
feather52840sense.menu.cppDbgLvl.error.build.cpp_debug=1
feather52840sense.menu.cppDbgLvl.warn=Warn
feather52840sense.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52840sense.menu.cppDbgLvl.info=Info
feather52840sense.menu.cppDbgLvl.info.build.cpp_debug=3
feather52840sense.menu.cppDbgLvl.debug=Debug
feather52840sense.menu.cppDbgLvl.debug.build.cpp_debug=4

