h2zero/n-able-Arduino/boards.txt
feather52840sense.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
feather52840sense.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
feather52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.maximum_size=827392
feather52840sense.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
feather52840sense.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840sense.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
feather52840sense.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

feather52840sense.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
feather52840sense.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
feather52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_ble.upload.maximum_size=823296
feather52840sense.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
feather52840sense.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840sense.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
feather52840sense.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

feather52840sense.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
feather52840sense.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
feather52840sense.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit_serial.upload.maximum_size=978944
feather52840sense.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
feather52840sense.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840sense.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
feather52840sense.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

feather52840sense.menu.bootloader.none=No bootloader
feather52840sense.menu.bootloader.none.bootloader.flags=
feather52840sense.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

itsybitsy52840.name=Adafruit ItsyBitsy nRF52840 Express

itsybitsy52840.vid.0=0x239A
itsybitsy52840.pid.0=0x8051
itsybitsy52840.vid.1=0x239A
itsybitsy52840.pid.1=0x0051
itsybitsy52840.vid.2=0x239A
itsybitsy52840.pid.2=0x0052
itsybitsy52840.vid.3=0x239A
itsybitsy52840.pid.3=0x8052

itsybitsy52840.upload.tool=openocd
itsybitsy52840.upload.target=nrf52
itsybitsy52840.upload.jlink_device=nRF52840_xxAA
itsybitsy52840.upload.use_1200bps_touch=true
itsybitsy52840.upload.wait_for_upload_port=true
itsybitsy52840.upload.maximum_size=1032192
itsybitsy52840.upload.maximum_data_size=262144

itsybitsy52840.bootloader.tool=openocd

itsybitsy52840.build.mcu=cortex-m4
itsybitsy52840.build.f_cpu=64000000
itsybitsy52840.build.board=NRF52840_ITSYBITSY
itsybitsy52840.build.core=nRF5
itsybitsy52840.build.variant=itsybitsy_nrf52840_express
itsybitsy52840.build.variant_system_lib=
itsybitsy52840.build.usb_manufacturer="Adafruit"
itsybitsy52840.build.usb_product="ItsyBitsy nRF52840 Express"
itsybitsy52840.build.vid=0x239A
itsybitsy52840.build.pid=0x8051
itsybitsy52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
itsybitsy52840.build.ldscript=nrf52840_xxaa.ld
itsybitsy52840.build.lfclk_flags=-DUSE_LFXO
itsybitsy52840.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
itsybitsy52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

itsybitsy52840.menu.role.all=All
itsybitsy52840.menu.role.all.build.nimble_flags=
itsybitsy52840.menu.role.periph=Peripheral
itsybitsy52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
itsybitsy52840.menu.role.adv=Advertiser
itsybitsy52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
itsybitsy52840.menu.role.scan=Scanner
itsybitsy52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
itsybitsy52840.menu.role.central=Client
itsybitsy52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

itsybitsy52840.menu.cppDbgLvl.none=None
itsybitsy52840.menu.cppDbgLvl.none.build.cpp_debug=0
itsybitsy52840.menu.cppDbgLvl.error=Error
itsybitsy52840.menu.cppDbgLvl.error.build.cpp_debug=1
itsybitsy52840.menu.cppDbgLvl.warn=Warn
itsybitsy52840.menu.cppDbgLvl.warn.build.cpp_debug=2
itsybitsy52840.menu.cppDbgLvl.info=Info
itsybitsy52840.menu.cppDbgLvl.info.build.cpp_debug=3
itsybitsy52840.menu.cppDbgLvl.debug=Debug
itsybitsy52840.menu.cppDbgLvl.debug.build.cpp_debug=4

itsybitsy52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
itsybitsy52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
itsybitsy52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.maximum_size=827392
itsybitsy52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
itsybitsy52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
itsybitsy52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
itsybitsy52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

itsybitsy52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
itsybitsy52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
itsybitsy52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_ble.upload.maximum_size=823296
itsybitsy52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
itsybitsy52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
itsybitsy52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
itsybitsy52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

itsybitsy52840.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
itsybitsy52840.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
itsybitsy52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit_serial.upload.maximum_size=978944
itsybitsy52840.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
itsybitsy52840.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
itsybitsy52840.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
itsybitsy52840.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

itsybitsy52840.menu.bootloader.none=No bootloader
itsybitsy52840.menu.bootloader.none.bootloader.flags=
itsybitsy52840.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


cplaynrf52840.name=Adafruit Circuit Playground Bluefruit

cplaynrf52840.vid.0=0x239A
cplaynrf52840.pid.0=0x8045
cplaynrf52840.vid.1=0x239A
cplaynrf52840.pid.1=0x0045
cplaynrf52840.vid.2=0x239A
cplaynrf52840.pid.2=0x8046

cplaynrf52840.upload.tool=openocd
cplaynrf52840.upload.target=nrf52
cplaynrf52840.upload.jlink_device=nRF52840_xxAA
cplaynrf52840.upload.use_1200bps_touch=true
cplaynrf52840.upload.wait_for_upload_port=true
cplaynrf52840.upload.maximum_size=1032192
cplaynrf52840.upload.maximum_data_size=262144

cplaynrf52840.bootloader.tool=openocd

cplaynrf52840.build.mcu=cortex-m4
cplaynrf52840.build.f_cpu=64000000
cplaynrf52840.build.board=NRF52840_CIRCUITPLAY
cplaynrf52840.build.core=nRF5
cplaynrf52840.build.variant=circuitplayground_nrf52840
cplaynrf52840.build.variant_system_lib=
cplaynrf52840.build.usb_manufacturer="Adafruit"
cplaynrf52840.build.usb_product="Circuit Playground Bluefruit"
cplaynrf52840.build.vid=0x239A
cplaynrf52840.build.pid=0x8045
cplaynrf52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
cplaynrf52840.build.ldscript=nrf52840_xxaa.ld
cplaynrf52840.build.lfclk_flags=-DUSE_LFRC
cplaynrf52840.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
cplaynrf52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

