h2zero/n-able-Arduino/boards.txt
cplaynrf52840.menu.role.all=All
cplaynrf52840.menu.role.all.build.nimble_flags=
cplaynrf52840.menu.role.periph=Peripheral
cplaynrf52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
cplaynrf52840.menu.role.adv=Advertiser
cplaynrf52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
cplaynrf52840.menu.role.scan=Scanner
cplaynrf52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
cplaynrf52840.menu.role.central=Client
cplaynrf52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

cplaynrf52840.menu.cppDbgLvl.none=None
cplaynrf52840.menu.cppDbgLvl.none.build.cpp_debug=0
cplaynrf52840.menu.cppDbgLvl.error=Error
cplaynrf52840.menu.cppDbgLvl.error.build.cpp_debug=1
cplaynrf52840.menu.cppDbgLvl.warn=Warn
cplaynrf52840.menu.cppDbgLvl.warn.build.cpp_debug=2
cplaynrf52840.menu.cppDbgLvl.info=Info
cplaynrf52840.menu.cppDbgLvl.info.build.cpp_debug=3
cplaynrf52840.menu.cppDbgLvl.debug=Debug
cplaynrf52840.menu.cppDbgLvl.debug.build.cpp_debug=4

cplaynrf52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
cplaynrf52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
cplaynrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.maximum_size=827392
cplaynrf52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
cplaynrf52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cplaynrf52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
cplaynrf52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

cplaynrf52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
cplaynrf52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
cplaynrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_ble.upload.maximum_size=823296
cplaynrf52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
cplaynrf52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cplaynrf52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
cplaynrf52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

cplaynrf52840.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
cplaynrf52840.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
cplaynrf52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit_serial.upload.maximum_size=978944
cplaynrf52840.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
cplaynrf52840.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cplaynrf52840.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
cplaynrf52840.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

cplaynrf52840.menu.bootloader.none=No bootloader
cplaynrf52840.menu.bootloader.none.bootloader.flags=
cplaynrf52840.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


cluenrf52840.name=Adafruit CLUE

cluenrf52840.vid.0=0x239A
cluenrf52840.pid.0=0x8071
cluenrf52840.vid.1=0x239A
cluenrf52840.pid.1=0x0071
cluenrf52840.vid.2=0x239A
cluenrf52840.pid.2=0x8072

cluenrf52840.upload.tool=openocd
cluenrf52840.upload.target=nrf52
cluenrf52840.upload.jlink_device=nRF52840_xxAA
cluenrf52840.upload.use_1200bps_touch=true
cluenrf52840.upload.wait_for_upload_port=true
cluenrf52840.upload.maximum_size=1032192
cluenrf52840.upload.maximum_data_size=262144

cluenrf52840.bootloader.tool=openocd

cluenrf52840.build.mcu=cortex-m4
cluenrf52840.build.f_cpu=64000000
cluenrf52840.build.board=NRF52840_CLUE
cluenrf52840.build.core=nRF5
cluenrf52840.build.variant=clue_nrf52840
cluenrf52840.build.variant_system_lib=
cluenrf52840.build.usb_manufacturer="Adafruit"
cluenrf52840.build.usb_product="CLUE"
cluenrf52840.build.vid=0x239A
cluenrf52840.build.pid=0x8071
cluenrf52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
cluenrf52840.build.ldscript=nrf52840_xxaa.ld
cluenrf52840.build.lfclk_flags=-DUSE_LFRC
cluenrf52840.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
cluenrf52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

cluenrf52840.menu.role.all=All
cluenrf52840.menu.role.all.build.nimble_flags=
cluenrf52840.menu.role.periph=Peripheral
cluenrf52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
cluenrf52840.menu.role.adv=Advertiser
cluenrf52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
cluenrf52840.menu.role.scan=Scanner
cluenrf52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
cluenrf52840.menu.role.central=Client
cluenrf52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

cluenrf52840.menu.cppDbgLvl.none=None
cluenrf52840.menu.cppDbgLvl.none.build.cpp_debug=0
cluenrf52840.menu.cppDbgLvl.error=Error
cluenrf52840.menu.cppDbgLvl.error.build.cpp_debug=1
cluenrf52840.menu.cppDbgLvl.warn=Warn
cluenrf52840.menu.cppDbgLvl.warn.build.cpp_debug=2
cluenrf52840.menu.cppDbgLvl.info=Info
cluenrf52840.menu.cppDbgLvl.info.build.cpp_debug=3
cluenrf52840.menu.cppDbgLvl.debug=Debug
cluenrf52840.menu.cppDbgLvl.debug.build.cpp_debug=4

cluenrf52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v6 softdevice)
cluenrf52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
cluenrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.maximum_size=827392
cluenrf52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
cluenrf52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cluenrf52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v6_adabl.hex
cluenrf52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v6_adabl.ld

cluenrf52840.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
cluenrf52840.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
cluenrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_ble.upload.maximum_size=823296
cluenrf52840.menu.bootloader.adafruit_ble.upload.maximum_data_size=237568
cluenrf52840.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cluenrf52840.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52840_s140_v7_adabl.hex
cluenrf52840.menu.bootloader.adafruit_ble.build.ldscript=nrf52840_s140_v7_adabl.ld

cluenrf52840.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
cluenrf52840.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
cluenrf52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
cluenrf52840.menu.bootloader.adafruit_serial.upload.maximum_size=978944
cluenrf52840.menu.bootloader.adafruit_serial.upload.maximum_data_size=262136
cluenrf52840.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cluenrf52840.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52840_serial_adabl.hex
cluenrf52840.menu.bootloader.adafruit_serial.build.ldscript=nrf52840_serial_adabl.ld

