h2zero/n-able-Arduino/boards.txt
nRF52833DK.menu.bootloader.none=No bootloader
nRF52833DK.menu.bootloader.none.bootloader.flags=
nRF52833DK.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex

nRF52833DK.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
nRF52833DK.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
nRF52833DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_ble.upload.maximum_size=262144
nRF52833DK.menu.bootloader.adafruit_ble.upload.maximum_data_size=106496
nRF52833DK.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52833DK.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52833_s140_v7_adabl.hex
nRF52833DK.menu.bootloader.adafruit_ble.build.ldscript=nrf52833_s140_v7_adabl.ld

nRF52833DK.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
nRF52833DK.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
nRF52833DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
nRF52833DK.menu.bootloader.adafruit_serial.upload.maximum_size=454656
nRF52833DK.menu.bootloader.adafruit_serial.upload.maximum_data_size=131064
nRF52833DK.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
nRF52833DK.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52833_serial_adabl.hex
nRF52833DK.menu.bootloader.adafruit_serial.build.ldscript=nrf52833_serial_adabl.ld


BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.jlink_device=nRF52833_xxAA
BBCmicrobitV2.upload.maximum_size=507904
BBCmicrobitV2.upload.maximum_data_size=131072
BBCmicrobitV2.upload.setup_command=transport select swd;

BBCmicrobitV2.bootloader.tool=openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld
BBCmicrobitV2.build.lfclk_flags=-DUSE_LFSYNT
BBCmicrobitV2.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BBCmicrobitV2.menu.role.all=All
BBCmicrobitV2.menu.role.all.build.nimble_flags=
BBCmicrobitV2.menu.role.periph=Peripheral
BBCmicrobitV2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobitV2.menu.role.adv=Advertiser
BBCmicrobitV2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobitV2.menu.role.scan=Scanner
BBCmicrobitV2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobitV2.menu.role.central=Client
BBCmicrobitV2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobitV2.menu.cppDbgLvl.none=None
BBCmicrobitV2.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobitV2.menu.cppDbgLvl.error=Error
BBCmicrobitV2.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobitV2.menu.cppDbgLvl.warn=Warn
BBCmicrobitV2.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobitV2.menu.cppDbgLvl.info=Info
BBCmicrobitV2.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobitV2.menu.cppDbgLvl.debug=Debug
BBCmicrobitV2.menu.cppDbgLvl.debug.build.cpp_debug=4

BBCmicrobitV2.menu.bootloader.adafruit_ble=Adafruit BLE (s140 v7 softdevice)
BBCmicrobitV2.menu.bootloader.adafruit_ble.bootloader.flags=-DUSE_ADA_BL -DADA_SD_BL
BBCmicrobitV2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_ble.upload.protocol=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_ble.upload.tool=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_ble.upload.maximum_size=262144
BBCmicrobitV2.menu.bootloader.adafruit_ble.upload.maximum_data_size=106496
BBCmicrobitV2.menu.bootloader.adafruit_ble.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
BBCmicrobitV2.menu.bootloader.adafruit_ble.build.bootloader.file=tools/nrf52833_s140_v7_adabl.hex
BBCmicrobitV2.menu.bootloader.adafruit_ble.build.ldscript=nrf52833_s140_v7_adabl.ld

BBCmicrobitV2.menu.bootloader.adafruit_serial=Adafruit Serial (no softdevice)
BBCmicrobitV2.menu.bootloader.adafruit_serial.bootloader.flags=-DUSE_ADA_BL
BBCmicrobitV2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_serial.upload.protocol=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_serial.upload.tool=adafruit-nrfutil
BBCmicrobitV2.menu.bootloader.adafruit_serial.upload.maximum_size=454656
BBCmicrobitV2.menu.bootloader.adafruit_serial.upload.maximum_data_size=131064
BBCmicrobitV2.menu.bootloader.adafruit_serial.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
BBCmicrobitV2.menu.bootloader.adafruit_serial.build.bootloader.file=tools/nrf52833_serial_adabl.hex
BBCmicrobitV2.menu.bootloader.adafruit_serial.build.ldscript=nrf52833_serial_adabl.ld

BBCmicrobitV2.menu.bootloader.none=No bootloader
BBCmicrobitV2.menu.bootloader.none.bootloader.flags=
BBCmicrobitV2.menu.bootloader.none.build.bootloader.file=tools/none_bootloader.hex


# nRF51822 variants
###################

Generic_nRF51822.name=Generic nRF51822

Generic_nRF51822.upload.tool=openocd
Generic_nRF51822.upload.target=nrf52
Generic_nRF51822.upload.jlink_device=nRF51802_{build.chip}
Generic_nRF51822.upload.maximum_size=258048

Generic_nRF51822.bootloader.tool=openocd

Generic_nRF51822.build.mcu=cortex-m0
Generic_nRF51822.build.f_cpu=16000000
Generic_nRF51822.build.board=GENERIC
Generic_nRF51822.build.core=nRF5
Generic_nRF51822.build.variant=Generic
Generic_nRF51822.build.variant_system_lib=
Generic_nRF51822.build.float_flags=
Generic_nRF51822.build.ldscript=nrf51_{build.chip}.ld
Generic_nRF51822.build.extra_flags=-DNRF51 {build.ram_size} {bootloader.flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Generic_nRF51822.menu.chip.xxaa.build.chip=xxaa
Generic_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Generic_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Generic_nRF51822.menu.chip.xxac.build.chip=xxac
Generic_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Generic_nRF51822.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF51822.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822.menu.lfclk.lfrc=RC Oscillator
Generic_nRF51822.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822.menu.lfclk.lfsynt=Synthesized
Generic_nRF51822.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF51822.menu.role.all=All
Generic_nRF51822.menu.role.all.build.nimble_flags=
Generic_nRF51822.menu.role.periph=Peripheral
Generic_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF51822.menu.role.adv=Advertiser
Generic_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF51822.menu.role.scan=Scanner
Generic_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF51822.menu.role.central=Client
Generic_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

